/* Homework №4

* Частина №1
Створити скрипт яки повинен виконувати наступне:
запитати у користувача рік народження;
запитати в нього, в якому місті він живе;
запитати його улюблений вид спорту.
При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
його вік;
якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.

Частина №2
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.
Все це має бути відображено в одному вікні (алерті).
Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .
* */
const getChampionName = (sport) => {
  switch (sport) {
    case "футбол":
      return "Лео Мессі";
    case "теніс":
      return "Новак Джокович";
    case "баскетбол":
      return "Леброн Джеймс";
    default:
      return "";
  }
}
const getCountryName = (capital) => {
  switch (capital) {
    case "Київ":
      return "України";
    case "Вашингтон":
      return "США";
    case "Лондон":
      return "Великобританії";
    default:
      return "";
  }
}
const homeWork4 = () => {
  const birthYear = prompt("Введіть ваш рік народження:");
  if (birthYear === null || birthYear === "") {
    return alert("Шкода, що Ви не захотіли ввести свій рік народження.");
  }
  const city = prompt("Введіть ваше місто проживання:");
  if (city === null || city === "")
    return alert("Шкода, що Ви не захотіли ввести своє місто.");
  const sport = prompt("Введіть ваш улюблений вид спорту (футбол, теніс, баскетбол):");
  const currentYear = new Date().getFullYear();
  const age = currentYear - parseInt(birthYear);

  let message = "Ваш вік: " + age + "\n";

  city === "Київ" || city === "Вашингтон" || city === "Лондон" ?
    message += "Ти живеш у столиці " + getCountryName(city) + "!"
    :
    message += "Ти живеш у місті " + city + "!";

  if (sport === "футбол" || sport === "теніс" || sport === "баскетбол") {
    const champion = getChampionName(sport);
    message += "\nКруто! Хочеш стати як " + champion + "?";
  }
  return alert(message);
}

homeWork4();
